Repository: win2013/RxProfile
Catalog: wiki/locale/po/*.po
Languages: ru

source: Set the administrator account and password first.
ru: Сначала установите учетную запись и пароль администратора.

source: You entered an invalid login or password.
ru: Вы указали неверное имя или пароль.

source: You are about to remove '%s' permanently!
ru: Вы собираетесь безвозвратно удалить '%s'!

source: Click %shere%s to remove the page now.
ru: Щелкните %sздесь%s для удаления страницы.

source: Otherwise press the "Back" button of your browser.
ru: Иначе нажмите кнопку Вашего браузера "Назад".

source: Function not yet implemented.
ru: Функция еще не реализована.

source: Remove page
ru: Удалить страницу

source: Removed page '%s' succesfully.
ru: Страница '%s' успешно удалена.

source: Pages which link to %s
ru: Страницы, которые ссылаются на %s

source: %d pages link to %s.
ru: %d страниц ссылаются на %s.

source: _wiki_name_regexp_
ru: (?<![[:alnum:]])([[:upper:]][[:lower:]]+)+[[:upper:]]?([[:upper:]][[:lower:]]+)+(?![[:alnum:]])

source: templates/browse.html
ru: locale/ru/templates/browse.html

source: templates/editpage.html
ru: locale/ru/templates/editpage.html

source: templates/editlinks.html
ru: locale/ru/templates/editlinks.html

source: templates/message.html
ru: locale/ru/templates/message.html

source: ./pgsrc
ru: locale/ru/pgsrc

source: '%s': corrupt file
ru: '%s': файл испорчен

source: %s: bad data<br>
ru: %s: неверные данные<br>

source: %s: Bad filename in database<br>
ru: %s: Неверное имя файла в базе данных<br>

source: WikiDiff::apply: line count mismatch: %s != %s
ru: WikiDiff::apply: количество строк не совпадает: %s != %s

source: WikiDiff::_check: failed
ru: WikiDiff::_check: сбой

source: WikiDiff::_check: edit sequence is non-optimal
ru: WikiDiff::_check: последовательность изменений не оптимальна

source: Current page:
ru: Текущая страница:

source: version %s
ru: версия %s

source: last modified on %s
ru: изменена %s

source: by %s
ru: %s

source: Archived page:
ru: Архивная страница:

source: Versions are identical
ru: Версии идентичны

source: Diff of %s.
ru: Изменения %s.

source: FrontPage
ru: ТитульнаяСтраница

source: Describe %s here.
ru: Опишите здесь %s.

source: Copy of %s
ru: Копия %s

source: No page name passed into editpage!
ru: Не указано имя страницы для редактирования!

source: This page has been locked by the administrator and cannot be edited.
ru: Эта страница была заблокирована администратором и не может быть изменена.

source: Sorry for the inconvenience.
ru: Извините за неудобство.

source: Problem while editing %s
ru: Проблема при редактировании %s

source: Searching for "%s" .....
ru: Поиск "%s" .....

source: (You entered an empty search string)
ru: (Вы указали пустую строку для поиска)

source: %d matches found in %d pages.
ru: Найдено %d совпадений в %d страницах.

source: Full Text Search Results
ru: Результаты полнотекстового поиска

source: Cannot establish connection to database, giving up.
ru: Не могу установить соединение с базой данных, отказ.

source: Error message: %s
ru: Сообщение об ошибке: %s

source: Cannot open database %s, giving up.
ru: Не могу открыть базу данных %s, отказ.

source: Insert/update to table 'wiki' failed: %s
ru: Сбой при выполнении вставки/обновления таблицы 'wiki': %s

source: Delete on %s failed: %s
ru: Сбой при удалении из %s: %s

source: Insert into %s failed: %s
ru: Сбой при вставке в %s: %s

source: Insert/update into table 'archive' failed: %s
ru: Сбой при выполнении вставки/обновления таблицы 'archive': %s

source: MSSQL error: %s
ru: Ошибка MSSQL: %s

source: Insert/Update failed: %s
ru: Сбой при выполнении вставки/обновления: %s

source: Cannot delete '%s' from table '%s'
ru: Не могу удалить '%s' из таблицы '%s'

source: MySQL error: %s
ru: Ошибка MySQL: %s

source: Error writing page '%s'
ru: Ошибка при записи страницы '%s'

source: Enter a page name
ru: Введите имя страницы

source: Go
ru: Выполнить

source: Show the page source and references
ru: Показать текст страницы и ссылки

source: PageInfo
ru: Инфо

source: Page name '%s' is not in the database
ru: В базе данных нет страницы с именем '%s'

source: Current version
ru: Текущая версия

source: Archived version
ru: Архивная версия

source: RecentChanges
ru: НедавниеИзменения

source: PhpWiki is unable to save your changes, because another user edited and saved the page while you were editing the page too. If saving proceeded now changes from the previous author would be lost.
ru: PhpWiki не может сохранить сделанные Вами изменения, так как за время редактирования страницы она была изменена и сохранена другим пользователем. Если продолжить сохранение, то изменения, сделанные другим пользователем, будут утеряны.

source: In order to recover from this situation follow these steps:
ru: Для выхода из создавшейся ситуации выполните следующие действия:

source: Use your browser's <b>Back</b> button to go back to the edit page.
ru: Используйте кнопку Вашего браузера <b>Назад</b> для возврата к экрану редактирования страницы.

source: Copy your changes to the clipboard or to another temporary place (e.g. text editor).
ru: Скопируйте Ваши изменения в буфер обмена или другое временное место (например, текстовый редактор).

source: <b>Reload</b> the page. You should now see the most current version of the page. Your changes are no longer there.
ru: <b>Обновите</b> страницу. Вы должны теперь видеть самую последнюю версию страницы. Эта версия страницы не содержит изменений, сделанных Вами.

source: Make changes to the file again. Paste your additions from the clipboard (or text editor).
ru: Повторно внесите Ваши изменения в файл. Вставьте Ваши дополнения и буфера обмена (или текстового редактора).

source: Press <b>Save</b> again.
ru: Снова нажмите <b>Сохранить</b>.

source: Problem while updating %s
ru: Проблема при обновлении %s

source: Thank you for editing %s.
ru: Благодарим за редактирование страницы %s.

source: Your careful attention to detail is much appreciated.
ru: Мы высоко ценим Ваше тщательное внимание к деталям.

source: %d pages match your query.
ru: %d страниц соответствую Вашему запросу.

source: Title Search Results
ru: Результаты поиска по заголовкам

source: Inserting page %s, version %s from %s
ru: Добавление станицы %s, версия %s из %s

source: _alnum_regexp_class_
ru: [0-9A-Za-z]|А|Б|В|Г|Д|Е|Ё|Ж|З|И|Й|К|Л|М|Н|О|П|Р|С|Т|У|Ф|Х|Ц|Ч|Ш|Щ|Ь|Ы|Ъ|Э|Ю|Я|а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ы|ъ|э|ю|я

source: _alpha_regexp_class_
ru: [A-Za-z]|А|Б|В|Г|Д|Е|Ё|Ж|З|И|Й|К|Л|М|Н|О|П|Р|С|Т|У|Ф|Х|Ц|Ч|Ш|Щ|Ь|Ы|Ъ|Э|Ю|Я|а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ы|ъ|э|ю|я

source: _upper_regexp_class_
ru: [A-Z]|А|Б|В|Г|Д|Е|Ё|Ж|З|И|Й|К|Л|М|Н|О|П|Р|С|Т|У|Ф|Х|Ц|Ч|Ш|Щ|Ь|Ы|Ъ|Э|Ю|Я

source: _lower_regexp_class_
ru: [a-z]|а|б|в|г|д|е|ё|ж|з|и|й|к|л|м|н|о|п|р|с|т|у|ф|х|ц|ч|ш|щ|ь|ы|ъ|э|ю|я

source: Search
ru: Поиск

source: %d best incoming links:
ru: %d лучших входящих ссылок:

source: %d best outgoing links:
ru: %d лучших исходящих ссылок:

source: %d most popular nearby:
ru: %d наиболее популярных соседних:
